"""
Пример кода с ошибкой № 2

Не забудь изучить операции со строками - "+" и "*"
"""

string_1 = 'Не знаю заметил ты или нет, но строки можно то записывать с помощью трех видов кавычек'
string_2 = "Прошлая строка записана в одинарных кавычках, а вот эта в двойных"
string_3 = """
А это что за монстр?
Да, многострочная строка... Она записывается с помощью тройных кавычек.
"""

string_4 = "Как говаривал один мой знакомый"

string_5 = " по поводу кавычек в питоне:'Да какая разница, какие использовать? Что вообще может пойти не так?'"

string_6 = string_4 + string_5

string_7 = '''
Да и в целом то я с ним согласен.
Кажется, что никаких проблем быть не должно.
'''

string_8 = '-' * 50
string_9 = string_8 + string_7

print(string_6)
print(string_9)

"""
19 строка: внутри кавычек (""), поставлены такие кавычки, исправить можно поставив кавычки, которые не используются вначале
24 строка: неправильно построена многострочная кавычка, нужно добавить ещё один идентичный знак
"""